;;; ligate.el --- True ligatures in Emacs  -*- lexical-binding: t; -*-
;;; Commentary:
;; Just uses ligature.el to enable Fira ligatures
;;; Code:
(defvar whitespace-ligatures '("[INFO]" "[WARN]" "[PASS]" "[VERBOSE]" "[KO]" "[OK]" "[PASS]" "[ERROR]" "[DEBUG]" "[INFO]" "[WARN]"
                               "[WARNING]" "[ERR]" "[FATAL]" "[TRACE]" "[FIXME]" "[TODO]" "[BUG]" "[NOTE]" "[HACK]" "[MARK]" "[FAIL]"
                               "// ERROR" "// DEBUG" "// INFO" "// WARN" "// WARNING" "// ERR" "// FATAL" "// TRACE" "// FIXME" "// TODO"
                               "// BUG" "// NOTE" "// HACK" "// MARK" "// FAIL" "# ERROR" "# DEBUG" "# INFO" "# WARN" "# WARNING" "# ERR"
                               "# FATAL" "# TRACE" "# FIXME" "# TODO" "# BUG" "# NOTE" "# HACK" "# MARK" "# FAIL"))


(defvar coding-ligatures '("!=" "!==" "!≡" "!≡≡" "!=<" "#(" "#_" "#{" "#?" "##" "#_(" "#[" "%=" "&%" "&&" "&+" "&-" "&/"
                           "&=" "&&&" "$>" "(|" "*>" "++" "+++" "+=" "+>" "++=" "--" "-<" "-<<" "-=" "->" "->>" "---" "-->"
                           "-+-" "-\\/" "-|>" "-<|" "->-" "-<-" "-|" "-||" "-|:" ".=" "//=" "/=" "/==" "/-\\" "/-:" "/->" "/=>"
                           "/-<" "/=<" "/=:" ":=" ":=" ":=>" ":-\\" ":=\\" ":-/" ":=/" ":-|" ":=|" ":|-" ":|=" "<$>" "<*" "<*>"
                           "<+>" "<-" "<<=" "<=" "<=>" "<>" "<|>" "<<-" "<|" "<=<" "<~" "<~~" "<<~" "<$" "<+" "<!>" "<@>" "<#>"
                           "<%>" "<^>" "<&>" "<?>" "<.>" "</>" "<\\>" "<\">" "<:>" "<~>" "<**>" "<<^" "<=" "<->" "<!--" "<--" "<~<"
                           "<==>" "<|-" "<||" "<<|" "<-<" "<-->" "<<==" "<==" "<-\\" "<-/" "<=\\" "<=/" "=<<" "==" "===" "==>" "=>"
                           "=~" "=>>" "=~=" "==>>" "=>=" "=<=" "=<" "==<" "=<|" "=/" "=/=" "=/<" "=|" "=||" "=|:" ">-" ">=" ">>-"
                           ">>=" ">=>" ">>^" ">>|" ">!=" ">->" ">==" ">=" ">/=" ">-|" ">=|" ">-\\" ">=\\" ">-/" ">=/" ">λ=" "?." "^="
                           "^^" "^<<" "^>>" "\\=" "\\==" "\\/-" "\\-/" "\\-:" "\\->" "\\=>" "\\-<" "\\=<" "\\=:" "|=" "|>=" "|>" "|+|"
                           "|->" "|-->" "|=>" "|==>" "|>-" "|<<" "||>" "|>>" "|-" "||-" "||=" "|)" "|]" "|-:" "|=:" "|-<" "|=<" "|--<"
                           "|==<" "~=" "~>" "~~>" "~>>" "[[" "[|" "_|_" "]]"))

(use-package ligature
  :straight t
  :config

  (ligature-set-ligatures t whitespace-ligatures)
  (ligature-set-ligatures 'prog-mode coding-ligatures)

  (global-ligature-mode 't))

(provide 'ligate)
;;; ligate.el ends here
